# პირველი ამოცანა: ორ ცვლადზე სამუშაო
num1 = float(input("შეიტანეთ პირველი რიცხვი: "))
num2 = float(input("შეიტანეთ მეორე რიცხვი: "))

# ჯამი, სხვაობა, ნამრავლი და განაყოფი
print("ჯამი:", num1 + num2)
print("სხვაობა:", num1 - num2)
print("ნამრავლი:", num1 * num2)
print("განაყოფი:", num1 / num2 if num2 != 0 else "არ შეიძლობა განაყოფი ზეროს მიერ")












# მეორე ამოცანა: სამი ცვლადის გამოყენება
name = input("შეიტანეთ თქვენი სახელი: ")
lastname = input("შეიტანეთ თქვენი გვარი: ")
age = int(input("შეიტანეთ თქვენი ასაკი: "))

# წინადადების გაწერა
print(f"მინდა გაცნობოთ, რომ ჩემი სახელი არის {name} {lastname} და მე ვარ {age} წლის.")