# ტოლობის შემოწმება: არის თუ არა 10 ტოლი 20-ის?
print(10 == 20)  # False

# უახლოეს თანასწორობის შემოწმება: არის თუ არა 10 არატოლი 20-ის?
print(10 != 20)  # True

# ნაკლებობის შემოწმება: არის თუ არა 10 ნაკლები ვიდრე 20?
print(10 < 20)  # True

# მეტობის შემოწმება: არის თუ არა 10 მეტი ვიდრე 20?
print(10 > 20)  # False

# ნაკლები ან ტოლი რაოდენობის შემოწმება: არის თუ არა 10 ნაკლები ან ტოლი ვიდრე 20?
print(10 <= 20)  # True

# მეტი ან ტოლი რაოდენობის შემოწმება: არის თუ არა 10 მეტი ან ტოლი ვიდრე 20?
print(10 >= 20)  # False
