#1. მომხმარებლის შემოტანილი რიცხვის დიაპაზონი (for ლუპით)
number = int(input("შეიტანეთ რიცხვი: "))
print("1-დან", number, "მდე რიცხვები:")
for i in range(1, number + 1):
    print(i)

# 2. 10-დან 20-მდე რიცხვების გამოტანა (while ციკლით)
print("\n10-დან 20-მდე რიცხვები:")
num = 10
while num <= 20:
    print(num)
    num += 1

# 3. 0-დან 100-მდე მხოლოდ ლუწი რიცხვების გამოტანა (while ციკლით)
print("\n0-დან 100-მდე მხოლოდ ლუწი რიცხვები:")
i = 0
while i <= 100:
    print(i)
    i += 2  # ლუწი რიცხვების გადაცემა
