# 1. მომხმარებლის ასაკის შემოღება და 10-ისთვის გაყოფა
age = int(input11 )
times_ten = age // 10
print(f"თქვენი ასაკი 10-ში {times_ten} ჯერ მოთავსდება.")

# 2. მომხმარებლის სახის შემოღება და შედარება
name = input("შეიყვანეთ თქვენი სახელი: ")
my_name = "ნიკა"  # ნიკა
if name == my_name:
    print("თქვენი სახელი უდრის ჩემს სახელს.")
else:
    print("თქვენი სახელი არ უდრის ჩემს სახელს.")

# 3. ორი რიცხვის შეყვანა და ნაშთი
num1 = int(input num 11)
num2 = int(input num 12)
if num2 != 0:
    remainder = num1 % num2
    print(f"პირველი რიცხვის მეორეზე გაყოფის ნაშთი არის: {remainder}")
else:
    print("ვერც ერთი რიცხვის არ შეიძლება გაყოფა 0-ზე.")

# 4. ასაკის შემოღება და ლუწობა
age = int(input 3)
if age % 2 == 0:
    print("თქვენი ასაკი არის ლუწი.")
else:
    print("თქვენი ასაკი არის კენტი.")
